load-testing.yml
# config:
#   target: 'http://127.0.0.1:3002/10003'

#   phases:
#     - duration: 60
#       arrivalRate: 10
#       name: 'Warm up'
#     - duration: 120
#       arrivalRate: 10
#       rampTo: 25
#       name: 'Ramp up'
#     - duration: 1200
#       arrivalRate: 25
#       name: 'Cruise'
#     - duration: 30
#       arrivalRate: 100
#       name: 'Crash'

config:
  target: 'http://127.0.0.1:3002'
  phases:
    - duration: 30
      arrivalRate: 50
      name: 'Warm up'
    - duration: 30
      arrivalRate: 50
      rampTo: 250
      name: 'Level 1'
    # - duration: 30
    #   arrivalRate: 250
    #   rampTo: 500
    #   name: 'Level 2'
    # - duration: 60
    #   arrivalRate: 500
    #   name: 'Cruise'

scenarios:
  - flow:
    - get:
        url: "/1003"